tap "argon/mas"
tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mas-cli/tap"
# GNU database manager
brew "gdbm"
# SSL/TLS cryptography library
brew "openssl"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# YAML Parser
brew "libyaml"
# Isolated development environments using Docker
brew "docker-compose"
# Secure your credentials in environment variables
brew "envchain"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Asynchronous event library
brew "libevent"
# Powerful, lightweight programming language
brew "lua"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Node.js version manager
brew "nodebrew"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Autoformat shell script source code
brew "shfmt"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim", args: ["with-lua", "with-override-system-vi"]
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn", args: ["without-node"]
# UNIX shell (command interpreter)
brew "zsh", args: ["without-etcdir"]
# Additional completion definitions for zsh
brew "zsh-completions"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "bitbar"
cask "discord"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "flash-player"
cask "flux"
cask "font-myrica"
cask "font-myricam"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gyazo"
cask "hyperswitch"
cask "iina"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "kindle"
cask "monolingual"
cask "postman"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "smcfancontrol"
cask "sourcetree"
cask "the-unarchiver"
cask "thunderbird"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "yabumi"
mas "GIF Brewery 3", id: 1081413713
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Monosnap", id: 540348655
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
